# Завдання 1
# Є деякий текст. Порахуйте в цьому тексті кількість речень і виведіть на екран отриманий результат.

text = """Процес кодування полягає в тому, що кожному символу алфавіту ставиться у відповідність унікальний код 
(від 0 до 255 в десятковій системі або його двійковому представленню від 00000000 до 11111111). Комп'ютер розрізняє (розпізнає) символи з їхнього коду. 
Для того, щоб розуміти, якому символу відповідає код, використовують так звані таблиці кодування, у яких кожному символу алфавіту (алфавітно-цифровому символу) поставлено 
відповідний набір числових значень (код)? Першою таблицею кодувань стала ASCII (англ. American Standard Code for Information Interchange — Американський стандартний код 
для інформаційного обміну). Перша версія ASCII використовувала лише 7 біт для представлення символу, відповідно потужність алфавіту була 127 символів мови. 
Перші 32 коди в таблиці називаються керуючими (використовуються для форматованого виведення тексту та інших службових цілей). Коди символів з літер і цифр знаходяться в 
діапазоні з 32 до 126 (код 127 не зайнятий жодним символом)!"""

sentences = 0
sentences += text.count(".")
sentences += text.count("?")
sentences += text.count("!")
sentences += text.count(";")
print(f"в тексті стільки речень : {sentences} ")


# Завдання 2
# Користувач вводить з клавіатури рядок. Перевірте чи є введений рядок паліндромом.
# Паліндром — слово або текст, що читається однаково зліва направо і справа наліво. Наприклад:
# Кок;
# Козак з казок;
# Радар;
# А мене нема.
text = input("Enter a sentence: ")

for i in range(len(text)// 2):
    if text[i] == text[-(i+1)]:
        continue
    else:
        print(f"\"{text}\" не паліндром")
        break
else:
    print(f"\"{text}\" паліндром")
# Завдання 3
# Користувач вводить рядок і два символи. Видаліть із рядка всі символи між першим входженням
# першого символу і першим входженням другого символу, включаючи самі символи. Виведіть результат.

text = input("Enter a sentence: ")
l1 = input("Enter a symbol 1: ")
l2 = input("Enter a symbol 2: ")

i1 = text.find(l1)
i2 = text.find(l2)

if i1 < i2:
    print(text[:i1]+text[i2+1:])
elif i2 < i1:
    print(text[:i2]+text[i1+1:])
else:
    print("error")