# Завдання 1
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні за таким правилом:
# якщо число кратне 7, його треба виводити на екран.
start = int(input("Enter start number: "))
end = int(input("Enter end number: "))
i = start
while i <= end:
    i += 1
    if i % 7 == 0:
        print(i)

# Завдання 2
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні. Потрібно вивести на
# екран:
# Усі числа діапазону.
# Усі числа діапазону в спадному порядку.
# Усі числа, кратні 7.
# Кількість чисел, кратних 5
start = int(input("Enter start number: "))
end = int(input("Enter end number: "))
i = start
while i <= end:
    print(i)
    i += 1

i = end
while i >= start:
    print(i)
    i -= 1

i = start
while i <= end:
    i += 1
    if i % 7 == 0:
        print(f"кратнe 7: {i}")

i = start
amt = 0
while i <= end:
    i += 1
    if i % 5 == 0:
        amt += 1
else:
    print(f"Кількість чисел, кратних 5: {amt}")

# Завдання 3
# Користувач вводить із клавіатури два числа (початок і кінець діапазону).
# Потрібно проаналізувати всі числа в цьому діапазоні. Виведення на екран
# має відбуватися за правилами, зазначеними нижче.
# Якщо число кратне 3 (ділиться на 3 без залишку) потрібно вивести
# слово "Fizz". Якщо число кратне 5 потрібно вивести слово "Buzz". Якщо число
# кратне 3 і 5 потрібно вивести "Fizz Buzz". Якщо число не кратне не 3 і 5
# потрібно вивести саме число.
start = int(input("Enter start number: "))
end = int(input("Enter end number: "))
i = start
while i <= end:
    if i % 3 == 0 and i % 5 == 0:
        print("Fizz Buzz")
    elif i % 3 == 0:
        print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    else:
        print(i)
    i += 1
# Завдання 4
# Користувач вводить два числа і крок (інтервал), з яким потрібно проходити
# по діапазону. Програма має показати числа від початку діапазону до кінця,
# збільшуючи кожне число на вказаний крок. Також програма повинна надавати
# вибір порядку виведення: у прямому або зворотному порядку.
start = int(input("Enter start number: "))
end = int(input("Enter end number: "))
interval = int(input("Enter interval: "))
choice = int(input("Виберіть порядок виведення: 1.у прямому або 2.зворотному порядку: "))

if choice == 1:
    i = start
    while i <= end:
        print(i)
        i += interval
elif choice == 2:
    i = end
    while i >= start:
        print(i)
        i -= interval
else:
    print("помилка")
# Завдання 5
# Користувач вводить два числа, що представляють діапазон. Програма повинна
# пройти по діапазону і вивести добуток усіх чисел, які діляться на 4, але
# не діляться на 6. Якщо таких чисел немає, вивести відповідне повідомлення.
# Діапазон має автоматично нормалізуватися, якщо початок більший за кінець.
start = int(input("Enter start number: "))
end = int(input("Enter end number: "))
if start > end:
    start, end = end, start
i = start
dobutok = 1
while i <= end:
    if i % 4 == 0 and i % 6 != 0:
        dobutok *= i
    i += 1

if dobutok > 1:
    print(f"добуток усіх чисел {dobutok}")
else:
    print("немає таких чисел")

# Завдання 6
# Користувач вводить два числа: число A і ступінь N, у який потрібно піднести
# число. Програма повинна обчислити A у степені N за допомогою циклу
# (без використання вбудованих функцій піднесення до степеня).
A = int(input("введіть число A: "))
N = int(input("введіть ступінь N: "))
i = 1
a_start = 1
n = A
while i <= N:
    a_start *= n
    i += 1
else:
    print(f"число {A} у степені {N} дорівнює {a_start}")