# Завдання 1
# Користувач вводить текст і набір символів. Видаліть з тексту всі
# слова, що містять хоча б один з цих символів, і виведіть результат.
import re

text = input("Enter a text: ")
symbols = input("Enter a set of symbols: ")

change_text = re.sub(rf"\b\w*[{symbols}]\w*\b", "", text)
print(change_text)


# Завдання 2
# Створіть програму, яка із введеного тексту створює "зворотний текст"
# (перевертає текст на рівні слів, а не символів). Наприклад, "я люблю Python"
# перетворюється на "Python люблю я"

ls = list(input("enter your text: ").split())
reverse_list = ls[::-1]
print(" ".join(reverse_list))

# Завдання 3
# Напиши програму, яка читає з консолі 1 рядок і визначає, чи є він валідним ідентифікатором змінної,
# валідний ідентифікатор має правила:
# Перший символ це латинська літера A-Z або a-z або символ підкреслення _
# Далі можуть бути латинські літери, цифри або _
# Довжина від 1 до 20 символів включно
# Треба вивести:
# OK якщо рядок валідний
# NO якщо невалідний
# Приклади
# Валідні:
# name
# _temp
# user1
# A
# var_20
# Невалідні:
# 1user (починається з цифри)
# my-name (дефіс не дозволений)
# hello world (пробіл)
# `` (порожній рядок)
# this_identifier_is_too_long (довше 20)

RX_ALLOWED = re.compile(r"^[A-Za-z_][A-Za-z0-9_]{0,19}$")

user_name = input("Enter your name: ")

if RX_ALLOWED.fullmatch(user_name):
    print("OK")
else:
    print("NO")
