# Завдання 1
# Напишіть гру Правда або Дія.
# Опис:
# 1. Спочатку, введіть імена гравців.
# 2. Кожен гравець по черзі обирає "Правда" або "Дія".
# 3. Якщо гравець обрав "Правда", йому задається
# запитання, на яке він повинен відповісти правдиво.
# 4. Якщо "Дія", гравець повинен виконати вказане
# завдання.
# 5. Після завершення кожного раунду, виведіть
# результати.
#
# Функції:
# get_player_names(): Запитайте імена гравців і поверніть
# їх у вигляді списку.
# ask_truth_or_dare(player): Функція, яка приймає ім'я
# гравця та запитує його, чи обирати "Правда" чи "Дія".
# ask_truth_question(player): Функція, яка приймає ім'я
# гравця, виберє одне запитання випадковим чином та
# просить гравця дати відповідь.
# perform_dare(player): Функція, яка приймає ім'я гравця
# та вибирає одне завдання випадковим чином та
# просить гравця виконаи його.
# Домашнє завдання
# play_game(players): Функція, яка керує ходом гри.
# Послідовно запитайте кожного гравця, чи обирати
# "Правда" чи "Дія", а потім відповідно викликайте
# функцію ask_truth_question або perform_dare.
#
# Константи:
# questions – список питань
# dares – список завдань
questions = [
    "Який твій найбільший страх?",
    "Чи є в тебе секрет, який ніхто не знає?",
    "Кого ти востаннє обговорював(-ла)?",
    "Яка твоя найбільша незручна ситуація?",
    "У кого з присутніх ти б хотів(-ла) помінятися життям?"
             ]

dares = [
    "Заспівай улюблену пісню.",
    "Станцюй 30 секунд без музики.",
    "Розкажи смішний анекдот.",
    "Зроби 10 присідань.",
    "Зобрази відому людину, щоб інші вгадали."
         ]
def get_player_names():
    """
    Отримує імена гравців від користувача.
    Користувач вводить імена через пробіл.

    Returns:
        list[str]: Список імен гравців.
    """

    return input("enter your names: ").strip().split()

def ask_truth_or_dare(player):
    """
    Запитує у гравця вибір між "Правдою" або "Дією".
    Якщо введено неправильний варіант, функція повторно запитує введення.
    Args:
        player (str): Ім'я гравця.

    Returns:
        str: Вибір гравця ("Правда" або "Дія").
    """

    answer = input(f"{player} \"Правда\" чи \"Дія\" ")

    if answer in ["Правда", "Дія"]:
        return answer

    else:
        print("Hе правильний варіант, спробуйте ще раз")
        return ask_truth_or_dare(player)


import random


def ask_truth_question(player):
    """
    Задає гравцю випадкове питання зі списку `questions`.

    Args:
        player (str): Ім'я гравця.
    Returns:
        str: Відповідь гравця на питання.
    """


    question = random.choice(questions)
    answer = input(f"{player} {question}")
    return answer

def perform_dare(player):
    """
    Вибирає випадкове завдання зі списку `dares` та пропонує гравцю його виконати.

    Args:
        player (str): Ім'я гравця.
    Returns:
        str: Відповідь або результат виконання завдання гравцем.
    """

    dare_question = random.choice(dares)
    answer = input(f"{player} {dare_question}")
    return answer


def play_game(players):
    """
    Основний цикл гри для всіх гравців.
    Кожен гравець по черзі обирає "Правду" або "Дію" та виконує відповідну дію.

    Args:
        players (list[str]): Список імен гравців.
    Returns:
        None
    """

    for player in players:
        choice = ask_truth_or_dare(player)

        if choice == "Правда":
            ask_truth_question(player)

        elif choice == "Дія":
            perform_dare(player)

def main():
    """
    Точка входу в програму.
    Отримує імена гравців та запускає гру.
    Returns:
        None
    """

    players = get_player_names()
    play_game(players)

if __name__ == '__main__':
    main()