# Завдання 1:
# Користувач вводить:
# час відправлення: години h (0–23) і хвилини m (0–59)
# тривалість дороги: t хвилин (може бути більше 60 і навіть більше 1440)
# Потрібно вивести:
# час прибуття у форматі HH:MM
# скільки повних діб пройде під час дороги (0, 1, 2, …)
# Приклад
#
# Ввід: 23 50 і 125
# Прибуття: 01:55
# Діб пройшло: 0 (бо менше 24 год)

from datetime import datetime, timedelta

hour = int(input("Enter hour: "))
minute = int(input("Enter minute: "))
duration = int(input("Enter duration: "))

start_time = datetime(2025, 1, 1, hour, minute)
end_time = start_time + timedelta(minutes=duration)
print(f"Ввід: {start_time.strftime("%H:%M")} і {duration}")
print(f"Прибуття: {end_time.strftime("%H:%M")}")
day_gone = duration // 1440
print(f"Діб пройшло: {day_gone}")


# Завдання 2:
# Умова:
# Користувач вводить 4-значне число (наприклад, 5831). Потрібно:
# вивести окремо кожну цифру (по одній в рядок)
# знайти суму цифр
# сформувати число навпаки (5831 → 1385)
# сформувати число з перших двох цифр і останніх двох цифр (наприклад 58 і 31)

number = int(input("Enter number: "))

n1 = number // 1000
n2 = (number % 1000) // 100
n3 = (number % 100) // 10
n4 = number % 10
print(f"{n1} \n{n2} \n{n3} \n{n4}")
print(f"summa {n1+n2+n3+n4} ")
print(f"{n4}{n3}{n2}{n1}") # aбо print(f"{n4*1000+n3*100+n2*10+n1}")
print(f"{n1}{n2} і {n3}{n4}") # aбо print(f"{n1*10+n2} і {n3*10+n4}")

# Завдання 3:
# Користувач вводить суму в гривнях (може бути дробова, наприклад 763.28). Треба:
# перевести суму в копійки (ціле число)
# порахувати, скільки потрібно купюр/монет, щоб видати цю суму мінімальною кількістю для
# номіналів: грн: 200, 100, 50, 20, 10, 5, 2, 1
# коп: 50, 25, 10, 5, 2, 1
# Вивести кількість кожного номіналу та підсумкову кількість усіх купюр/монет.

uah = float(input("Enter amount of uah: "))
kop = int(round(uah * 100))
print(kop)
k200 = kop // 20000; kop %= 20000
k100 = kop // 10000; kop %= 10000
k50 = kop // 5000; kop %= 5000
k20 = kop // 2000; kop %= 2000
k10 = kop // 1000; kop %= 1000
k5 = kop // 500; kop %= 500
k2 = kop // 200; kop %= 200
k1 = kop // 100; kop %= 100


c50 = kop // 50; kop %= 50
c25 = kop // 25; kop %= 25
c10 = kop // 10; kop %= 10
c5 = kop // 5; kop %= 5
c2 = kop // 2; kop %= 2
c1 = kop // 1; kop %= 1

print(f"200 грн купюр треба: {k200}")
print(f"100 грн купюр треба: {k100}")
print(f"50 грн купюр треба: {k50}")
print(f"20 грн купюр треба: {k20}")
print(f"10 грн купюр треба: {k10}")
print(f"5 грн купюр треба: {k5}")
print(f"2 грн купюр треба: {k2}")
print(f"1 грн купюр треба: {k1}")

print(f"50 копійок треба: {c50}")
print(f"25 копійок треба: {c25}")
print(f"10 копійок треба: {c10}")
print(f"5 копійок треба: {c5}")
print(f"2 копійки треба: {c2}")
print(f"1 копійка треба: {c1}")
print(f"підсумкову кількість усіх купюр/монет: {k200 + k100 + k50 + k20 + k10 + k5 + k2 + k1 + c50 + c25 + c10 + c5 + c2 + c1}")




