# Завдання 1
# Користувач вводить з клавіатури три числа.
# Необхідно знайти суму чисел, добуток чисел.
# Результат обчислень вивести на екран.

number1 = int(input("Введіть число: "))
number2 = int(input("Введіть число: "))
number3 = int(input("Введіть число: "))

summa = number1 + number2 + number3
multi = number1 * number2 * number3

print(f"сума чисел дорівнює {summa} \nдобуток чисел дорівнює {multi}")

# Завдання 2
# Напишіть програму, що обчислює площу ромба.
# Користувач з клавіатури вводить довжину двох його діагоналей.

diagonal1 = int(input("введіть діагональ: "))
diagonal2 = int(input("введіть діагональ: "))

S = 0.5 * diagonal1 * diagonal2
print(f"Площа ромба дорівнює {S}")

# Завдання 3
# Користувач вводить з клавіатури три числа.
# Перше число - зарплата за місяць, друге число — сума місячного платежу
# за кредитом у банку, третє число — заборгованість за комунальні послуги.
# Необхідно вивести на екран суму, яка залишиться у користувача після всіх виплат.

number1 = int(input("Введіть заробітну плату: "))
number2 = int(input("Введіть місячний платіж: "))
number3 = int(input("Введіть заборгованість за комуналку: "))

calc = number1 - (number2 + number3)
print(f"Залишок після всіх виплат: {calc}")

# Завдання 4
# Напишіть програму, яка обчислює вартість поїздки на автомобілі.
# Користувач вводить відстань у кілометрах, витрату палива на 100 кілометрів і ціну за літр бензину.
# Програма повинна вивести підсумкову вартість поїздки.
distance = int(input("Введіть відстань: "))
fuel100km = int(input("Введіть витрату палива на 100км: "))
fuel_price = int(input("Введіть ціну за паливо: "))

drive_cost = distance * (fuel100km / 100) * fuel_price
print(f"вартість поїздки складає {drive_cost}")

# Завдання 5
# Користувач вводить загальну суму рахунку в ресторані та кількість осіб, які будуть ділити рахунок.
# Напишіть програму, яка розраховує суму чайових (15% від загальної суми) і загальну суму,
# включаючи чайові. Потім програма повинна розділити загальну суму з чайовими на кількість осіб
# і вивести, скільки кожна людина має заплатити.
visitors = int(input("введіть кількість осіб: "))
bill = int(input("введіть суму рахунку: "))

tips = bill * 0.15
total_bill = bill + tips
print(f"Чайові складають:{tips}, загальна сума: {total_bill}")

one_visitor = total_bill / visitors
print(f"Кожна людина повина сплатити: {one_visitor}")

# Завдання 6
# Користувач вводить вартість оренди автомобіля за день, кількість днів оренди та суму застави,
# яку потрібно внести. Напишіть програму, яка розраховує загальну вартість оренди (з урахуванням застави)
# і виводить суму, яку необхідно заплатити користувачеві після повернення автомобіля
# (припускаючи, що застава повертається повністю). Програма повинна також розділити
# підсумкову суму оренди (без застави) на кількість днів і вивести вартість оренди за один день.

rent_price = int(input("Введіть вартість оренди "))
rent_days = int(input("Введіть кількість днів оренди "))
deposit = int(input("Введіть суму застави "))

total_rent = rent_price * rent_days + deposit
return_rent = deposit

print(f"Загальна вартість оренди (з урахуванням застави): {total_rent}")
print(
    f"Сума, яку необхідно заплатити користувачеві після повернення4 автомобіля: {return_rent}"
)
print(
    f"Вартість оренди за один день (без застави): {(total_rent - deposit) / rent_days}"
)
