# for in

# for <variable> in <container>:
# .... code
# .... code

line = "у разі вибору пункту 4"

for i in line:
    print(i)


# range(start, stop) - от старта до стопа
# range(stop) - от 0 до стопа
# range(start, stop, step) - от старта до стопа с определенным шагом
r1 = range(2, 10, 2)  # 2, 4, 6, 8
r2 = range(10, 2, -2)  # 10, 8, 6, 4

for i in range(10, 2, -2):  # покажет 10, 8, 6, 4
    print(i)

for i in range(5):  # 5 раз напишет hello
    print("hello")


for i in range(1, 11):  # - делает табличку умножения
    for j in range(1, 11):
        print(i * j, end="\t")
    print()

# Завдання 2
# Користувач вводить із клавіатури число. Потрібно порахувати
# факторіал числа. Наприклад, якщо введено 3, факторіал числа 1*2*3 = 6.
# Формула для розрахунку факторіалу: n! = 1*2*3...*n, де n —
# число для розрахунку факторіалу.

facterial = int(input("Enter a factorial: "))
n = 1
for i in range(1, facterial + 1):
    n *= i
print(n)

# Завдання 3
# Користувач вводить із клавіатури довжину лінії. Потрібно
# відобразити на екрані горизонтальну лінію з *, вказаної довжини.
# Наприклад, якщо було введено 7, тоді виведення на екран буде таким:
# *******

leigh = int(input("Enter a leigh: "))
for i in range(1, leigh + 1):
    print("*", end="")

# for _ in range(1, leigh+1): - правило хорошего тона если і негде больше не используется можно ставить _
#     print("*", end="")


# Завдання 4
# Користувач вводить з клавіатури довжину лінії та символ для
# заповнення лінії. Потрібно відобразити на екрані горизонтальну
# лінію із введеного символу, зазначеної довжини.
# Наприклад, якщо було введено 5 і &, тоді виведення на екран
# буде таким:
# &;&;&;&;&;

line = ""
width = int(input("Enter a width: "))
for i in range(1, width + 1):
    line += "&"
print(line)

# Завдання 5
# Створіть програму, яка відображає меню з опціями для вибору:
# 1 — знайти мінімум двох чисел, 2 — знайти максимум двох чисел,
# 3 — вихід. Програма має запитувати в користувача номер опції і,
# якщо вибрано пункт 1 або 2, запитувати введення двох чисел, після
# чого знаходити і виводити або мінімум (якщо вибрано 1), або максимум
# (якщо вибрано 2) із введених чисел. При введенні пункту 3 програма
# завершує роботу, виводячи повідомлення про вихід. Якщо введено
# некоректну опцію, програма має повідомити про помилку і знову показати меню.
# Програма має працювати в циклі, повторюючи виведення меню і виконання дій доти,
# доки не буде обрано вихід.

while True:
    print(" menu: ")
    print("1. min")
    print("2. max")
    print("3. exit")

    choice = int(input("Enter your choice: "))

    if choice == 1:
        a = float(input("Enter a number: "))
        b = float(input("Enter another number: "))
        # A if <cond> else B
        print("min: ", a if a < b else b)
    elif choice == 2:
        a = float(input("Enter a number: "))
        b = float(input("Enter another number: "))
        # A if <cond> else B
        print("max: ", a if a > b else b)
    elif choice == 3:
        print("exit")
        break
    else:
        print("invalid choice")
