# Завдання 1
# Напишіть функцію, яка повертає добуток чисел у вказаному діапазоні.
# Межі діапазону передаються як параметри. Якщо межі діапазону
# переплутані (наприклад, 5 — верхня межа, 25 — нижня межа),
# їх потрібно поміняти місцями.
n1 = int(input("Enter a number: "))
n2 = int(input("Enter another number: "))

def dobutok(n1, n2):
    if n1 > n2:
        n1, n2 = n2, n1
    inner_n = 1
    for i in range(n1, n2+1):
        inner_n *= i
    return inner_n

print(dobutok(n1, n2))


# Завдання 2
# Напишіть функцію для знаходження максимуму в списку цілих.
# Список передається як параметр.
ls = [9, 2, 7, 4, 5]

def find_max(ls: list):
    print(max(ls))

find_max(ls)
# Завдання 3
# Напишіть функцію, що обчислює суму елементів списку цілих.
# Список передається як параметр.
ls = [9, 2, 7, 4, 5]

def summa_in_list(ls: list):
    print(sum(ls))

summa_in_list(ls)


