# Завдання 1: «Комуналка за електроенергію»
# Умова
# Користувач вводить споживання електроенергії за місяць у кВтгод.
# Потрібно порахувати суму до сплати за тарифними діапазонами.
# Вимоги (що зробити)
# Зчитати kwh (ціле число).
# Порахувати оплату по частинах:
# перші 100 кВт·год → 1.20 грн/кВт год
# наступні 200 (тобто 101–300) → 1.50 грн/кВт·год
# усе, що понад 300 → 1.80 грн/кВт год
# Вивести:
# загальну суму
# окремо: скільки кВт·год у кожному діапазоні
# Приклад вводу/виводу
# Ввід (що вводять):
# Введіть споживання (кВт·год): 350
# Вивід (що вивести):
# До 100: 100 кВт·год
# 101-300: 200 кВт·год
# Понад 300: 50 кВт·год
# Сума: 525.0 грн
# Додаткові коментарі (рекомендації)
# Якщо kwh < 0 — вивести Помилка вводу.
# Розв’язання тільки через if / elif / else і арифметику (без циклів, без методів).


kwl = int(input("ведіть споживання (кВт·год):"))

if kwl < 0:
    print("Помилка вводу")
else:
    if kwl <= 100:
        t1 = kwl
        t2 = 0
        t3 = 0
    elif kwl <= 300:
        t1 = 100
        t2 = kwl - 100
        t3 = 0
    else:
        t1 = 100
        t2 = 200
        t3 = kwl - 300

total = t1 * 1.2 + t2 * 1.5 + t3 * 1.8

print(f"До 100: {t1} кВт·год")
print(f"101-300: {t2} кВт·год")
print(f"Понад 300: {t3} кВт·год")
print(f"Сума: {total} грн")

# Завдання 2: «Кінотеатр: ціна квитка»
# Умова
# Ціна квитка залежить від віку та дня тижня.
# Вимоги (що зробити)
# Зчитати:
# age (int)
# day (int, 1–7), де 6–7 — вихідні
# Базова ціна:
# будні (1–5) - 160 грн
# вихідні (6–7) - 200 грн
# Знижка за віком:
# age < 6 → квиток безкоштовно (0 грн)
# 6 <= age <= 12 - -50%
# age >= 60 - -30%
# інакше - без знижки
# Вивести фінальну ціну.
# Приклад вводу/виводу
# Ввід (що вводять):
# Введіть вік: 10
# Введіть день тижня (1-7): 7
# Вивід (що вивести):
# Ціна квитка: 100 грн
# Додаткові коментарі (рекомендації)
# Якщо day не 1–7 або age < 0 - вивести Помилка вводу.
# Не використовувати try/except і методи рядків.

age = int(input("введіть ваш вік"))
day = int(input("введіть день тижня(1-7)"))
price = 0
if 1 < day < 7 and age < 0:
    print("Помилка вводу")
else:
    if day <= 5:
        price += 160
    else:
        price += 200
    if age < 6:
        price = 0
    elif age <= 12:
        price = price - (price * 0.5)
    elif age >= 60:
        price = price - (price * 0.30)

print(f"Ціна квитка:{price}")

# Завдання 3: «Пора року за номером місяця» (match)
# Умова
# Користувач вводить номер місяця month (1–12). Вивести пору року і назву кварталу.
# Вимоги (що зробити)
# Зчитати month (int).
# Використати match month:
# 12, 1, 2 → Зима
# 3, 4, 5 → Весна
# 6, 7, 8 → Літо
# 9, 10, 11 → Осінь
# інакше → Невірний місяць
# Додатково визначити квартал:
# 1–3 → Q1, 4–6 → Q2, 7–9 → Q3, 10–12 → Q4
# Приклад вводу/виводу
# Ввід (що вводять):
# Введіть номер місяця (1-12): 4
# Вивід (що вивести):
# Пора року: Весна
# Квартал: Q2
# Додаткові коментарі (рекомендації)
# Квартал можна зробити через if/elif/else, а пору року - через match.
# Без списків/словників.

month = int(input("Введіть номер місяця (1-12):"))
sezon = ""
match month:
    case 12 | 1 | 2:
        sezon = "Зима"
    case 3 | 4 | 5:
        sezon = "Весна"
    case 6 | 7 | 8:
        sezon = "Літо"
    case 9 | 10 | 11:
        sezon = "Осінь"
    case _:
        print("Невірний місяць")
print(f"Пора року: {sezon}")

Quartal = ""
if 1 >= month <= 3:
    Quartal = "Q1"
elif 4 >= month <= 6:
    Quartal = "Q2"
elif 7 >= month <= 9:
    Quartal = "Q3"
elif 10 >= month <= 12:
    Quartal = "Q4"
print(f"Квартал: {Quartal}")

# Завдання 4: «Індекс маси тіла (BMI)»
# Умова
# Користувач вводить вагу (кг) і зріст (м). Порахувати BMI і вивести категорію.
# Вимоги (що зробити)
# Зчитати:
# weight (float)
# height (float)
# Обчислити bmi = weight / (height * height)
# Визначити категорію:
# bmi < 18.5 → Недостатня вага
# 18.5 <= bmi < 25 → Норма
# 25 <= bmi < 30 → Надлишкова вага
# bmi >= 30 → Ожиріння
# Вивести BMI і категорію.
# Приклад вводу/виводу
# Ввід (що вводять):
# Введіть вагу (кг): 72
# Введіть зріст (м): 1.78
# Вивід (що вивести):
# BMI: 22.72
# Категорія: Норма
# Додаткові коментарі (рекомендації)
# Якщо height <= 0 або weight <= 0 - Помилка вводу.
# Для виводу BMI достатньо round(bmi, 2) (це функція, не метод).


weight = float(input("Введіть вагу (кг): "))
height = float(input("Введіть зріст (м): "))
if weight <= 0 or height <= 0:
    print("Помилка вводу.")
else:
    bmi = weight / (height * height)
    print(f"BMI: {round(bmi,2)}")
    if bmi < 18.5:
        print("Категорія: Недостатня вага")
    elif 18.5 <= bmi < 25:
        print("Категорія: Норма")
    elif 25 <= bmi < 30:
        print("Категорія: Hадлишкова вага")
    elif bmi > 30:
        print("Категорія: Ожиріння")

# Завдання 5: «Середнє без дробів + isinstance»
# Умова
# Користувач вводить три цілі числа. Якщо середнє значення виходить цілим - вивести як int,
# інакше — як float. Також вивести тип результату через isinstance.
# Вимоги (що зробити)
# Зчитати a, b, c (int).
# Обчислити s = a + b + c.
# Якщо s ділиться на 3 без остачі (s % 3 == 0):
# avg = s // 3 (буде int)
# інакше:
# avg = s / 3 (буде float)
# Перевірити тип:
# якщо isinstance(avg, int) - вивести Тип: int
# інакше якщо isinstance(avg, float) - вивести Тип: float
# Вивести avg.
# Приклад вводу/виводу
# Ввід (що вводять):
# Введіть a: 10
# Введіть b: 11
# Введіть c: 12
# Вивід (що вивести):
# Середнє: 11
# Тип: int
# Додаткові коментарі (рекомендації)
# Це завдання спеціально тренує різницю між / і //, модуль %, та isinstance.
# Не використовувати try/except, методи, контейнери.

a = int(input("Введіть a: "))
b = int(input("Введіть b: "))
c  =int(input("Введіть c: "))

S = a + b + c

if S % 3 == 0:
    avg = S // 3
else:
    avg = S / 3
print(f"Середнє:{avg}")
if isinstance(avg, float):
    print(f"Тип: float")
elif isinstance(avg, int):
    print("Тип: int")
